


// // // const excelToJson = require('convert-excel-to-json');
// // // const region = require('./regions');

// // // const result = excelToJson({
// // //     sourceFile: 'med.xlsx'
// // // });



// // // for (let index = 1; index < result['Лист1'].length; index++) {
// // //     const element = result['Лист1'][index]['B'];
// // //     const element1 = result['Лист1'][index]['C'];
// // //     const element2 = result['Лист1'][index]['D'];
// // //     const element3 = result['Лист1'][index]['E'];
// // //     const element4 = result['Лист1'][index]['F'];
// // //     const element5 = result['Лист1'][index]['G'];
// // //     console.log(element);
// // //     console.log(element1);
// // //     console.log(element2);
// // //     console.log(element3);
// // //     console.log(element4);
// // //     console.log(element5);
// // // }


// // // // console.log(region['areas'].filter(x => x.name.includes(result['Лист1'][1]['D'])) );




// // let {
// //     parsePhoneNumber,
// //     AsYouType,
// //     PhoneNumber,
// //     Metadata,
// //     getCountryCallingCode
// // } = require('libphonenumber-js');
// // let phones = ['380965895953', '+380965895953', '12345678999987', '123456', '23423406812']

// // let format = (phone, country = 'UA') => {
// //     if (phone) {
// //         const { Metadata, getCountryCallingCode } = require('libphonenumber-js');
// //         const metadata = new Metadata();
// //         metadata.selectNumberingPlan(country);
// //         let rx = /(?<=(?:^\+380)|(?:^380)|(?:^80)|(?:^0))\d+/gm;
// //         let number = phone.match(rx)?.[0] ?? phone;

// //         let maxLen = metadata.numberingPlan.possibleLengths()[0] + getCountryCallingCode(country).length;
// //         number = number.slice(0, maxLen);
// //         number = `+${getCountryCallingCode(country).slice(0, maxLen - number.length)}` + number;
// //         number = number + " ".repeat(maxLen + 1 - number.length);
// //         number = number.replace(/\+(.{2})(.{3})(.{3})(.{2})(.{2})/, "+$1 $2 $3 $4 $5").trimEnd();
// //         return number;
// //     }

// //     return '';
// // }
// // let time0 = Date.now();
// // for (let i = 0; i < 100000; i++) {
// //     phones.forEach(x => {
// //         let number = format(x);
// //     });
// //     process.stdout.write(`\r${~~(i / (100000 / 100))}%`);
// // }
// // let time1 = Date.now();
// // console.log(`Elapsed time:${time1 - time0}ms`);


// let t = {
//     "Украина": {
//         "title": "Посольство Украины",
//         "number": "+38 (044) 238-16-57",
//         "source": 5
//     },
//     "Австралия": {
//         "title": "Посольство Украины",
//         "number": "(+61) 452 664 592",
//         "source": 5
//     },
//     "Австрия": {
//         "title": "Посольство Украины",
//         "number": "(+43) 1 479 717 252",
//         "source": 5
//     },
//     "Азербайджан": {
//         "title": "Посольство Украины",
//         "number": "(+99450) 255 75 18",
//         "source": 5
//     },
//     "Албания": {
//         "title": "Посольство Украины",
//         "number": "(+3069) 3276 5606",
//         "source": 5
//     },
//     "Алжир": {
//         "title": "Посольство Украины",
//         "number": "(+213) 553 384 241",
//         "source": 5
//     },
//     "Ангола": {
//         "title": "Посольство Украины",
//         "number": "(+244) 2227 167 58",
//         "source": 5
//     },
//     "Аргентина": {
//         "title": "Посольство Украины",
//         "number": "(+549) 1161 99 94 14",
//         "source": 5
//     },
//     "Афганистан": {
//         "title": "Посольство Украины",
//         "number": "(+992) 37 235 84 12",
//         "source": 5
//     },
//     "Бангладеш": {
//         "title": "Посольство Украины",
//         "number": "(+91) 9205 507 157",
//         "source": 5
//     },
//     "Бельгия": {
//         "title": "Посольство Украины",
//         "number": "(+320) 47 625 77 35",
//         "source": 5
//     },
//     "Бенин": {
//         "title": "Посольство Украины",
//         "number": "(+234)8091155338",
//         "source": 5
//     },
//     "Беларусь": {
//         "title": "Посольство Украины",
//         "number": "(+375) 2560 311 84",
//         "source": 5
//     },
//     "Болгария": {
//         "title": "Посольство Украины",
//         "number": "(+359) 878 015 102",
//         "source": 5
//     },
//     "Боливия": {
//         "title": "Посольство Украины",
//         "number": "(+55)-61-33-65-14-57",
//         "source": 5
//     },
//     "Босния и Герцоговина": {
//         "title": "Посольство Украины",
//         "number": "(+3851)-461-62-96",
//         "source": 5
//     },
//     "Ботсвана": {
//         "title": "Посольство Украины",
//         "number": "(+460) 8545 258 80",
//         "source": 5
//     },
//     "Бразилия": {
//         "title": "Посольство Украины",
//         "number": "(+55) 1195 9578 289",
//         "source": 5
//     },
//     "Ватикан": {
//         "title": "Посольство Украины",
//         "number": "(+39) 0639 378 800",
//         "source": 5
//     },
//     "Великая Британия": {
//         "title": "Посольство Украины",
//         "number": "(+44) 7553 483 628",
//         "source": 5
//     },
//     "Въетнам": {
//         "title": "Посольство Украины",
//         "number": "(+8424) 9034 222 16",
//         "source": 5
//     },
//     "Армения": {
//         "title": "Посольство Украины",
//         "number": "(+374) 7710 0273",
//         "source": 5
//     },
//     "Гватемала": {
//         "title": "Посольство Украины",
//         "number": "(+52155) 78 78 07 08",
//         "source": 5
//     },
//     "Гвинея": {
//         "title": "Посольство Украины",
//         "number": "(+7499) 238 10 85",
//         "source": 5
//     },
//     "Гвинея-Бисау": {
//         "title": "Посольство Украины",
//         "number": "(+221) 77 474 55 63",
//         "source": 5
//     },
//     "Греция": {
//         "title": "Посольство Украины",
//         "number": "(+3069) 327 656 06",
//         "source": 5
//     },
//     "Грузия": {
//         "title": "Посольство Украины",
//         "number": "(+995) 5950 822 88",
//         "source": 5
//     },
//     "Дания": {
//         "title": "Посольство Украины",
//         "number": "(+45) 7154 1531",
//         "source": 5
//     },
//     "Эквадор": {
//         "title": "Посольство Украины",
//         "number": "(+51)-16-39-68-56",
//         "source": 5
//     },
//     "Эстония": {
//         "title": "Посольство Украины",
//         "number": "(+372) 588 744 77",
//         "source": 5
//     },
//     "Эфиопия": {
//         "title": "Посольство Украины",
//         "number": "(+251)-96-741-90-01",
//         "source": 5
//     },
//     "Египет": {
//         "title": "Посольство Украины",
//         "number": "(+20)100 003 96 48",
//         "source": 5
//     },
//     "Йемен": {
//         "title": "Посольство Украины",
//         "number": "(+966)114508534",
//         "source": 5
//     },
//     "Израиль": {
//         "title": "Посольство Украины",
//         "number": "(+972) 54 667 67 82",
//         "source": 5
//     },
//     "Индия": {
//         "title": "Посольство Украины",
//         "number": "(+9192) 055 071 57",
//         "source": 5
//     },
//     "Индонезия": {
//         "title": "Посольство Украины",
//         "number": "(+62) 8788 489 0918",
//         "source": 5
//     },
//     "Ирак": {
//         "title": "Посольство Украины",
//         "number": "(+964) 780 986 51 70",
//         "source": 5
//     },
//     "Иран": {
//         "title": "Посольство Украины",
//         "number": "(+98) 9128 436 681",
//         "source": 5
//     },
//     "Ирландия": {
//         "title": "Посольство Украины",
//         "number": "(+353) 86 069 09 30",
//         "source": 5
//     },
//     "Исландия": {
//         "title": "Посольство Украины",
//         "number": "(+35840) 471 92 00",
//         "source": 5
//     },
//     "Испания": {
//         "title": "Посольство Украины",
//         "number": "(+34620) 641 324",
//         "source": 5
//     },
//     "Италия": {
//         "title": "Посольство Украины",
//         "number": "(+39) 351 988 68 23",
//         "source": 5
//     },
//     "Иордания": {
//         "title": "Посольство Украины",
//         "number": "(+962) 77 673 90 34",
//         "source": 5
//     },
//     "Казахстан": {
//         "title": "Посольство Украины",
//         "number": "(+7705) 755 66 10",
//         "source": 5
//     },
//     "Канада": {
//         "title": "Посольство Украины",
//         "number": "(+1613) 617 23 35",
//         "source": 5
//     },
//     "Катар": {
//         "title": "Посольство Украины",
//         "number": "(+974) 668 531 82",
//         "source": 5
//     },
//     "Кения": {
//         "title": "Посольство Украины",
//         "number": "(+254)-205-22-45-45",
//         "source": 5
//     },
//     "Кыргызстан": {
//         "title": "Посольство Украины",
//         "number": "(+996) 701 888 463",
//         "source": 5
//     },
//     "Китай": {
//         "title": "Посольство Украины",
//         "number": "(+86137) 0123 06 47",
//         "source": 5
//     },
//     "Кипр": {
//         "title": "Посольство Украины",
//         "number": "(+357) 96 109 331",
//         "source": 5
//     },
//     "Код-д'Ивуар": {
//         "title": "Посольство Украины",
//         "number": "(+221)-338-59-02-02",
//         "source": 5
//     },
//     "Колумбия": {
//         "title": "Посольство Украины",
//         "number": "(+22) 617 09 73",
//         "source": 5
//     },
//     "Коморские острова": {
//         "title": "Посольство Украины",
//         "number": "(+254)-205-22-45-45",
//         "source": 5
//     },
//     "Корея": {
//         "title": "Посольство Украины",
//         "number": "(+8210) 3035 69 10",
//         "source": 5
//     },
//     "Коста Рика": {
//         "title": "Посольство Украины",
//         "number": "(+52155) 78 78 07 08",
//         "source": 5
//     },
//     "Куба": {
//         "title": "Посольство Украины",
//         "number": "(+535) 429 51 31",
//         "source": 5
//     },
//     "Кувейт": {
//         "title": "Посольство Украины",
//         "number": "(+965) 998 445 03",
//         "source": 5
//     },
//     "Латвия": {
//         "title": "Посольство Украины",
//         "number": "(+371) 29 23 92 62",
//         "source": 5
//     },
//     "Литва": {
//         "title": "Посольство Украины",
//         "number": "(+3706) 555 01 94",
//         "source": 5
//     },
//     "Ливан": {
//         "title": "Посольство Украины",
//         "number": "(+961) 592 16 68",
//         "source": 5
//     },
//     "Ливия": {
//         "title": "Посольство Украины",
//         "number": "(+216) 941 273 42",
//         "source": 5
//     },
//     "Люксембург": {
//         "title": "Посольство Украины",
//         "number": "(+352) 691 253 045",
//         "source": 5
//     },
//     "Мавритания": {
//         "title": "Посольство Украины",
//         "number": "(+212) 661 18 63 90",
//         "source": 5
//     },
//     "Малайзия": {
//         "title": "Посольство Украины",
//         "number": "(+6016) 748 41 23",
//         "source": 5
//     },
//     "Мальдивы": {
//         "title": "Посольство Украины",
//         "number": "(+9111)-26145093",
//         "source": 5
//     },
//     "Мальта": {
//         "title": "Посольство Украины",
//         "number": "(+39) 351 988 6823",
//         "source": 5
//     },
//     "Марокко": {
//         "title": "Посольство Украины",
//         "number": "(+212) 661 18 63 90",
//         "source": 5
//     },
//     "Мексика": {
//         "title": "Посольство Украины",
//         "number": "(+52155) 78 78 07 08",
//         "source": 5
//     },
//     "Мозамбик": {
//         "title": "Посольство Украины",
//         "number": "(+2768) 198 71 12",
//         "source": 5
//     },
//     "Молдова": {
//         "title": "Посольство Украины",
//         "number": "(+373) 22 592 987",
//         "source": 5
//     },
//     "Монголия": {
//         "title": "Посольство Украины",
//         "number": "(+86137) 01 23 06 47",
//         "source": 5
//     },
//     "Нигерия": {
//         "title": "Посольство Украины",
//         "number": "(+2348) 176 788 395",
//         "source": 5
//     },
//     "Нидерланды": {
//         "title": "Посольство Украины",
//         "number": "(+316) 17 47 46 07",
//         "source": 5
//     },
//     "Германия": {
//         "title": "Посольство Украины",
//         "number": "(+4930) 2888 7116",
//         "source": 5
//     },
//     "Новая Зеландия": {
//         "title": "Посольство Украины",
//         "number": "(+6145) 266 45 92",
//         "source": 5
//     },
//     "Норвегия": {
//         "title": "Посольство Украины",
//         "number": "(+47) 909 270 40",
//         "source": 5
//     },
//     "ОАЭ": {
//         "title": "Посольство Украины",
//         "number": "(+9715) 044 253 13",
//         "source": 5
//     },
//     "Пакистан": {
//         "title": "Посольство Украины",
//         "number": "(+9251) 260 89 66",
//         "source": 5
//     },
//     "Палестина": {
//         "title": "Посольство Украины",
//         "number": "(+9705) 996 995 61",
//         "source": 5
//     },
//     "Панама": {
//         "title": "Посольство Украины",
//         "number": "(+52155) 78 78 07 08",
//         "source": 5
//     },
//     "ЮАР": {
//         "title": "Посольство Украины",
//         "number": "(+2768) 198 71 12",
//         "source": 5
//     },
//     "Парагвай": {
//         "title": "Посольство Украины",
//         "number": "(+54) 11 4775 3476",
//         "source": 5
//     },
//     "Перу": {
//         "title": "Посольство Украины",
//         "number": "(+51) 993 458 779",
//         "source": 5
//     },
//     "Северная Македония": {
//         "title": "Посольство Украины",
//         "number": "(+389) 72 589 639",
//         "source": 5
//     },
//     "Польша": {
//         "title": "Посольство Украины",
//         "number": "(+48) 698 608 837",
//         "source": 5
//     },
//     "Португалия": {
//         "title": "Посольство Украины",
//         "number": "(+351) 965 088 115",
//         "source": 5
//     },
//     "Россия": {
//         "title": "Посольство Украины",
//         "number": "(+7)919 768 77 96",
//         "source": 5
//     },
//     "Руанда": {
//         "title": "Посольство Украины",
//         "number": "(+254) 733 366 366",
//         "source": 5
//     },
//     "Румыния": {
//         "title": "Посольство Украины",
//         "number": "(+40) 2123 036 60",
//         "source": 5
//     },
//     "Саудовская Аравия": {
//         "title": "Посольство Украины",
//         "number": "(+9665) 052 201 93",
//         "source": 5
//     },
//     "Сенегал": {
//         "title": "Посольство Украины",
//         "number": "(+221) 77 474 55 63",
//         "source": 5
//     },
//     "Сербия": {
//         "title": "Посольство Украины",
//         "number": "(+381) 63 111 31 85",
//         "source": 5
//     },
//     "Сирия": {
//         "title": "Посольство Украины",
//         "number": "(+963)-116-11-30-16",
//         "source": 5
//     },
//     "Сингапур": {
//         "title": "Посольство Украины",
//         "number": "(+65) 9238 7576",
//         "source": 5
//     },
//     "Словакия": {
//         "title": "Посольство Украины",
//         "number": "(+421) 259 202 813",
//         "source": 5
//     },
//     "Словения": {
//         "title": "Посольство Украины",
//         "number": "(+386) 317 027 65",
//         "source": 5
//     },
//     "Судан": {
//         "title": "Посольство Украины",
//         "number": "(+20100) 003 96 48",
//         "source": 5
//     },
//     "США": {
//         "title": "Посольство Украины",
//         "number": "(+1) 2023 222 616",
//         "source": 5
//     },
//     "Сьерра-Леоне": {
//         "title": "Посольство Украины",
//         "number": "(+234)8091155338",
//         "source": 5
//     },
//     "Таджикистан": {
//         "title": "Посольство Украины",
//         "number": "(+992) 37 235 84 12",
//         "source": 5
//     },
//     "Таиланд": {
//         "title": "Посольство Украины",
//         "number": "(+66)-26-85-32-16",
//         "source": 5
//     },
//     "Восточный Тимор": {
//         "title": "Посольство Украины",
//         "number": "(+60)-321-66-95-52",
//         "source": 5
//     },
//     "Тунис": {
//         "title": "Посольство Украины",
//         "number": "(+216)-71-84-98-61",
//         "source": 5
//     },
//     "Турция": {
//         "title": "Посольство Украины",
//         "number": "(+90) 539 550 98 98",
//         "source": 5
//     },
//     "Туркменистан": {
//         "title": "Посольство Украины",
//         "number": "(+99) 365 69 51 12",
//         "source": 5
//     },
//     "Венгрия": {
//         "title": "Посольство Украины",
//         "number": "(+36) 142 241 18",
//         "source": 5
//     },
//     "Узбекистан": {
//         "title": "Посольство Украины",
//         "number": "(+998) 7123 355 96",
//         "source": 5
//     },
//     "Уругвай": {
//         "title": "Посольство Украины",
//         "number": "(+549) 1161 999 414",
//         "source": 5
//     },
//     "Филиппины": {
//         "title": "Посольство Украины",
//         "number": "(+60)-321-66-95-52",
//         "source": 5
//     },
//     "Финляндия": {
//         "title": "Посольство Украины",
//         "number": "(+358) 4047 192 00",
//         "source": 5
//     },
//     "Франция": {
//         "title": "Посольство Украины",
//         "number": "(+33) 6-07-71-53-56",
//         "source": 5
//     },
//     "Хорватия": {
//         "title": "Посольство Украины",
//         "number": "(+385) 916 051 010",
//         "source": 5
//     },
//     "Чад": {
//         "title": "Посольство Украины",
//         "number": "(+216)-71-84-98-61",
//         "source": 5
//     },
//     "Чехия": {
//         "title": "Посольство Украины",
//         "number": "(+420) 6022 249 38",
//         "source": 5
//     },
//     "Чили": {
//         "title": "Посольство Украины",
//         "number": "(+549) 1161 999 414",
//         "source": 5
//     },
//     "Черногория": {
//         "title": "Посольство Украины",
//         "number": "(+382) 6769 8686",
//         "source": 5
//     },
//     "Швейцария": {
//         "title": "Посольство Украины",
//         "number": "(+41) 7865 456 61",
//         "source": 5
//     },
//     "Швеция": {
//         "title": "Посольство Украины",
//         "number": "(+46) 7040 761 03",
//         "source": 5
//     },
//     "Шри-Ланка": {
//         "title": "Посольство Украины",
//         "number": "(+91) 9205 507 157",
//         "source": 5
//     },
//     "Япония": {
//         "title": "Посольство Украины",
//         "number": "(+81) 9017 754 206",
//         "source": 5
//     }
// }


exports = async function (payload) {


    let obj = {

        fullName: {
            name: '',
            surname: '',
            patronymic: ''
        },
        birth: {
            date: "",
            month: "",
            year: "",
            place: ""
        },
        createdDate: Date.now(),
        modifiedDate: Date.now(),
        sex: "",
        status: "missing",
        deleted: false,
        attributes: [{
            type: "",
            value: ""
        }],
        active: false,
        social: [],
        meta: {
            createdBy: "",
            modifiedBy: [{
                userSSOId: "",
                date: Date.now()
            }]
        }
    }


    const serialized = payload.body.text();
    const body = JSON.parse(serialized);
    const mongodb = context.services.get("mongodb-atlas");
    const mycollection = mongodb.db("memoryofukraine").collection("peoples");
    let result = mycollection.insertOne({ ...obj, ...body });

    return result;
};